trade_exp/src/Documents/НачисленияКредитовИДепозитов/НачисленияКредитовИДепозитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8b84ed48-f371-48d6-be7c-fda11c0fb81d">
  <name>НачисленияКредитовИДепозитов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="85b450ef-d645-4ff9-8ce1-4deacd28566a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="277fc52c-0c11-40b3-b8fb-452e08748739">
    <name>Начисления</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bdc21a62-4641-40fd-a6a4-d41f2008af8a">
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9be5f5d0-d8a2-410a-b5c1-902b5a9dd729">
      <name>Договор</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/НачисленияКредитовИДепозитов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&ИзменениеИКонтроль("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ИсправлениеДокументов.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ЭтотОбъект, "Начисления");

	ПараметрыВыбораСтатейИАналитик = Документы.НачисленияКредитовИДепозитов.ПараметрыВыбораСтатейИАналитик(ХозяйственнаяОперация);
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
	#Вставка
		Док_ЗаполнитьВалютуВТЧ();
	#КонецВставки	

	НачисленияКредитовИДепозитовЛокализация.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры

#КонецОбласти
Процедура Док_ЗаполнитьВалютуВТЧ()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НачисленияКредитовИДепозитовНачисления.Ссылка КАК Ссылка,
		|	НачисленияКредитовИДепозитовНачисления.НомерСтроки КАК НомерСтроки,
		|	НачисленияКредитовИДепозитовНачисления.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	НачисленияКредитовИДепозитовНачисления.Договор
		|ИЗ
		|	Документ.НачисленияКредитовИДепозитов.Начисления КАК НачисленияКредитовИДепозитовНачисления
		|ГДЕ
		|	НачисленияКредитовИДепозитовНачисления.Ссылка = &Ссылка
		|	И НачисленияКредитовИДепозитовНачисления.ВалютаВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ТабличнаяЧасть = Начисления;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТЧ = ТабличнаяЧасть.Найти(ВыборкаДетальныеЗаписи.НомерСтроки, "НомерСтроки");
			//СтрокаТЧ = ТабличнаяЧасть.Получить(ИДСтроки); 
			ПолученнаяВалюта = ВыборкаДетальныеЗаписи.Договор.ВалютаВзаиморасчетов;
			Если Не ЗначениеЗаполнено(ПолученнаяВалюта) Тогда
			  ПолученнаяВалюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Организация);		
			КонецЕсли;
			СтрокаТЧ.ВалютаВзаиморасчетов = ПолученнаяВалюта;
		КонецЦикла;
	КонецЕсли

КонецПроцедуры

#КонецЕсли
